org/articles/dancegames.org
#+TITLE: Dance Games: How I Learned to Stop Worrying and Love Cardio
* Dance Games: How I Learned to Stop Worrying and Love Cardio

#+BEGIN_QUOTE
Draft: v1.0 | Posted: 08/23/2022 | Updated: 08/23/2022 | confidence of success: 30% | estimated time to completion: 08/23/2025 | importance: Low
#+END_QUOTE


** Abstract 

You probably don't like cardio. Most people don't. You probably like video games. Otherwise I'm not sure why you would be on my web page. If you grew up in the aughts like I did, you probably have played /[[https://en.wikipedia.org/wiki/Dance_Dance_Revolution][Dance Dance Revolution]]/ (DDR), and if you are like me, you probably liked it. People who grew up in the heyday of arcade culture still play dance games, and have managed to turn it into an endurance sport. If you like games, modern dance game setups are trivially inexpensive compared to the cost of most forms of cardio equipment, and it's fun. This page contains my notes on getting started, and how I have broken through different blocks for different methods of playing. I'm fairly average at these types of games, but I plan on updating this as I have more things to say.

** Sportification

I, like many people, didn't really care for cardio-based exercise once upon a time. I had a vague desire to move around more for health reasons, but the actual moving around part was not terribly enjoyable. I liked sports growing up, but coordinating people to play sports with, who have roughly the same schedule as you, etc was much harder in adulthood than it was in high school. So, I embarked in search of something which I could generally do alone, which was kind of sporty, relatively inexpensive, and would capture my interest for a long period of time. One arcade trip later, I decided upon dance games. 

I think the concept of sport is relatively interesting, since I think it is something which will naturally emerge from any high-skill activity which multiple people can compete in, either against some sort of objective function (e.g. running times, high scores) or directly against each other (i.e. opponents, opposing teams). My go-to answer to this is [[https://en.wikipedia.org/wiki/Competitive_karuta][Competitive Karuta]], a japanese card game for which players compete to find the second verse of a poem which is read aloud by a third party. This is generally an idle diversion in broader Japan, but a specific group of hardcore karuta players are so skilled at this that they've "sportified" it by adding a memorization phase and becoming so good at card-taking that [[https://www.jstage.jst.go.jp/article/ipsjjip/26/0/26_38/_article/-char/ja/][20 ms error is only enough to correctly judge the winner 69.2% of the time]]. 

So it is with all high-skill, human-oriented activity; the more people do a thing the more that thing will come to resemble sport rather than diversion. Dance Games (e.g. DDR) are a fun example of this, because it has all the makings of an endurance sport despite being a video game. Dance game players [[https://www.youtube.com/watch?v=wiOOOAw2AfY][really push themselves]], and a substantial part of the "meta" is about efficient form, fitness, and successful engagement with your equipment (not, in my opinion, far off from cycling). In a year or so of playing I noticed my resting heart rate drop from 59 to the high 40s, and moving around in general just feels much easier for me compared to before I started playing. I'm not going to claim playing stepmania will make you lose a bunch of weight (at least not like [[https://planetbanatt.net/articles/health.html][tracking]] will), but cardio's effects on [[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3951958/#:~:text=Taken%2520together%252C%2520the%2520findings%2520across,tasks%2520requiring%2520top%252Ddown%2520cognitive][cognition]] alone constitute good enough reason to give it a shot if you manage to find a way to like it.

** You, Too, Can Dance

Contrary to what you may believe, you do not need to travel to an arcade multiple times a week to play dance games. In fact, you can play a nearly endless supply of intense, high-level charts from the comfort of your own home, provided you live on the ground floor, or hate your downstairs neighbors. 

Fundamentally, to play dance games, you will need two, maybe three things.

1. A pad
2. A bar, if you plan on using the bar
3. A game to connect the pad to

** Acquiring a Pad

