articles/dancegames.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-26 Sun 20:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dance Games: How I Learned to Stop Worrying and Love Cardio</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">

<!-- Global site tag (gtag.js) - Google Analytics -->




<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">







<link rel="stylesheet" type="text/css" href="./css/default.css" />
<link rel="shortcut icon" type="image/jpg" href="./favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Dance Games: How I Learned to Stop Worrying and Love Cardio</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org606aec5">Dance Games: How I Learned to Stop Worrying and Love Cardio</a>
<ul>
<li><a href="#orgb9d8abe">Abstract</a></li>
<li><a href="#org95a0ec2">Sportification</a></li>
<li><a href="#org332bed1">You, Too, Can Dance</a></li>
<li><a href="#orgef9e5a9">Acquiring a Pad</a>
<ul>
<li><a href="#org2a48aea">Please Do Not Start With a Soft Pad</a></li>
<li><a href="#orgb1aca5b">Building a Pad</a></li>
<li><a href="#org9e11d7f">Buying a Pad</a></li>
</ul>
</li>
<li><a href="#org261d883">Playing the Game</a>
<ul>
<li><a href="#orge70f4c1">Pack Recommendations for Beginners</a></li>
</ul>
</li>
<li><a href="#orge301ac5">Progressing Advice</a></li>
<li><a href="#org35ef56e">Breaking Through 10 block</a></li>
<li><a href="#org0203b33">Progression Advice for Stamina</a></li>
<li><a href="#org4b327eb">Progression Advice for Tech</a></li>
<li><a href="#org43eeb04">My Stamina Block Milestones</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org606aec5" class="outline-1">
<h1 id="org606aec5">Dance Games: How I Learned to Stop Worrying and Love Cardio</h1>
<div class="outline-text-1" id="text-org606aec5">
<blockquote>
<p>
Draft: v1.0 | Posted: 08/23/2022 | Updated: 08/23/2022 | confidence of success: 30% | estimated time to completion: 08/23/2025 | importance: Low
</p>
</blockquote>
</div>


<div id="outline-container-orgb9d8abe" class="outline-2">
<h2 id="orgb9d8abe">Abstract</h2>
<div class="outline-text-2" id="text-orgb9d8abe">
<p>
You probably don't like cardio. Most people don't. You probably like video games. Otherwise I'm not sure why you would be on my web page. If you grew up in the aughts like I did, you probably have played <i><a href="https://en.wikipedia.org/wiki/Dance_Dance_Revolution">Dance Dance Revolution</a></i> (DDR), and if you are like me, you probably liked it. People who grew up in the heyday of arcade culture still play dance games, and have managed to turn it into an endurance sport. If you like games, modern dance game setups are trivially inexpensive compared to the cost of most forms of cardio equipment, and it's fun. This page contains my notes on getting started, and how I have broken through different blocks for different methods of playing. I'm fairly average at these types of games, but I plan on updating this as I have more things to say.
</p>
</div>
</div>

<div id="outline-container-org95a0ec2" class="outline-2">
<h2 id="org95a0ec2">Sportification</h2>
<div class="outline-text-2" id="text-org95a0ec2">
<p>
I, like many people, didn't really care for cardio-based exercise once upon a time. I had a vague desire to move around more for health reasons, but the actual moving around part was not terribly enjoyable. I liked sports growing up, but coordinating people to play sports with, who have roughly the same schedule as you, etc was much harder in adulthood than it was in high school. So, I embarked in search of something which I could generally do alone, which was kind of sporty, relatively inexpensive, and would capture my interest for a long period of time. One arcade trip later, I decided upon dance games. 
</p>

<p>
I think the concept of sport is relatively interesting, since I think it is something which will naturally emerge from any high-skill activity which multiple people can compete in, either against some sort of objective function (e.g. running times, high scores) or directly against each other (i.e. opponents, opposing teams). My go-to answer to this is <a href="https://en.wikipedia.org/wiki/Competitive_karuta">Competitive Karuta</a>, a japanese card game for which players compete to find the second verse of a poem which is read aloud by a third party. This is generally an idle diversion in broader Japan, but a specific group of hardcore karuta players are so skilled at this that they've "sportified" it by adding a memorization phase and becoming so good at card-taking that <a href="https://www.jstage.jst.go.jp/article/ipsjjip/26/0/26_38/_article/-char/ja/">20 ms error is only enough to correctly judge the winner 69.2% of the time</a>. 
</p>

<p>
So it is with all high-skill, human-oriented activity; the more people do a thing the more that thing will come to resemble sport rather than diversion. Dance Games (e.g. DDR) are a fun example of this, because it has all the makings of an endurance sport despite being a video game. Dance game players <a href="https://www.youtube.com/watch?v=wiOOOAw2AfY">really push themselves</a>, and a substantial part of the "meta" is about efficient form, fitness, and successful engagement with your equipment (not, in my opinion, far off from cycling). In a year or so of playing I noticed my resting heart rate drop from 59 to the high 40s, and moving around in general just feels much easier for me compared to before I started playing. I'm not going to claim playing stepmania will make you lose a bunch of weight (at least not like <a href="https://planetbanatt.net/articles/health.html">tracking</a> will), but cardio's effects on <a href="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3951958/#:~:text=Taken%2520together%252C%2520the%2520findings%2520across,tasks%2520requiring%2520top%252Ddown%2520cognitive">cognition</a> alone constitute good enough reason to give it a shot if you manage to find a way to like it.
</p>
</div>
</div>

<div id="outline-container-org332bed1" class="outline-2">
<h2 id="org332bed1">You, Too, Can Dance</h2>
<div class="outline-text-2" id="text-org332bed1">
<p>
Contrary to what you may believe, you do not need to travel to an arcade multiple times a week to play dance games. In fact, you can play a nearly endless supply of intense, high-level charts from the comfort of your own home, provided you live on the ground floor, or hate your downstairs neighbors. 
</p>

<p>
Fundamentally, to play dance games, you will need two, maybe three things.
</p>

<ol class="org-ol">
<li>A pad</li>
<li>A bar, if you plan on using the bar</li>
<li>A game to connect the pad to</li>
</ol>
</div>
</div>
