org/articles/dancegames.org
*** Please Do Not Start With a Soft Pad

For the sake of everybody's sanity, please do not bother "trying the game out" on a soft pad or a foam pad. Soft pads are notoriously horrible, they rarely properly register your steps, you will hate playing on it, and you will conclude you hate dance games even if you would have loved them with a better start. Some people may tell you "you can probably clear up to ITG 10s on soft pads", and while this is certainly true, the people saying this are [[https://en.wikipedia.org/wiki/Survivorship_bias][survivorship biasing]] you. Soft pads are pads which are servicable if you are desperate to play dance games, and will force you to play charts which are much lower than your "true" arcade block level. 

Save yourself the trouble and start on a pad which will listen to your feet, even if you are a beginner. You do not need a home setup right away if you are not sure whether or not you will like it. If you do not know if you will like dance games (whether that is DDR, In The Groove, Pump It Up, or whatever), try to make your way out to an arcade and play on arcade pads. You can find arcades near you using the [[https://zenius-i-vanisher.com/v5.2/arcades.php][Zanius-i-Vanisher arcade finder tool]]: just look for DDR / ITG / StepmaniaX / Pump It Up machines near you. If that's fun, consider buying/building a hard pad, or going to the arcade more regularly. 

*** Building a Pad

If you are handy, you can build a pad with about $80 worth of parts. [[https://www.youtube.com/channel/UC5PzDDBBf5tIwItQRFnM0NA][Bandit]] has a great guide to building a very basic pad which you can find below.

#+BEGIN_EXPORT html
<iframe width="560" height="315" src="https://www.youtube.com/embed/y6wGYLE0YI4" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_EXPORT

I primarily play on one of these pads and have cleared up to ITG 14s / DDR 17s on it. I find the panels are more than big enough to play tech charts on, as well. Just don't play on this barefoot since the panel edges are fairly sharp. For a bar, I use a walker I bought on amazon. Lots of people just use a chair.

#+BEGIN_EXPORT html
<iframe width="560" height="315" src="https://www.youtube.com/embed/Kkrlbx6Fp0o" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_EXPORT

Other options to build pads can be found on the [[https://itgwiki.dominick.cc/en/hardware/itg-dance-pads][ITG wiki]], I am merely posting what worked for me.

*** Buying a Pad

If you don't like the idea of building something, the consensus best pre-built pad are [[https://www.maty-taneczne.pl/shop/dance-mat-ex-pro-metal-black/][L-Tek pads]], sometimes called "polish pads". I started using one of these pads when I moved to Los Angeles, and didn't have a car to drive around to hardware stores to buy materials to build one. Overall I agree that these pads are of high quality: they are a good option even out-of-the-box for beginner and intermediate players, and they are good pads both for tech charts and stamina charts. Ultimately I think I prefer the fsr pads, but there's no denying that L-Tek pads deliver an experience much closer to typical unmodded arcade pads compared to a travel pad.

If you want to get really into the game, I highly recommend modding your pads. There's two primary options: [[https://www.youtube.com/watch?v=Mi1IvZiLhL4][Penny Modding]], which you can do with tape and pennies lying around, or [[https://ddrpad.com/collections/l-tek-pad-parts/products/l-tek-copper-sensitivity-mod][copper tape modkits]] floating around on sites like DDRPad. I used the latter, and it was completely night and day -- hitting brackets (two panels with one foot) immediately went from impossible to fairly easy, and I could hit closer to the edges of the panels rather than needing to go all the way out to the center of each panel with my steps (which encourages good habits / tighter form).

Likewise, you'll probably need a bar. As mentioned before, there's lots of good options. I used a [[https://www.amazon.com/Booty-Kicker-Exercise-Portable-Exercises/dp/B089N3CKGZ][Booty Kicker Barre]] which is pretty popular in the dance game discords (I think it's for ballet exercises or something). One thing I've heard a lot is to avoid the L-Tek bar setup, which I hear is very wobbly and still expensive. You can really use anything.

** Playing the Game

The standard way to play 4-panel dance games (henceforth ITG) is through various forks of [[https://www.stepmania.com/][StepMania]]. I personally recommend [[https://www.itgmania.com/][ITGmania]], which is a 5.1 stepmania fork which is pre-built for higher level play / comes with some common themes. StepMania runs on toasters, there's a version floating around which runs on Raspberry Pi 3. I ran the game on my regular desktop computer started out, but I later bought a used dell optiplex from the stone age as a dedicated machine to run stepmania in my home gym. You don't need to buy anything new or fancy to run the game, it'll run on any old computer or laptop you happen to be using already.

*** Pack Recommendations for Beginners

Once you get the game, you'll want song packs. Generally speaking, I think it's good to get a pretty broad beginner exposure to the different /types/ of charts when you are new to the game. In my opinion, the best ways to do this are as follows:

- DDR: DDR charts from [[https://zenius-i-vanisher.com/v5.2/simfiles.php?category=simfiles][Zanius-I-Vanisher]]
- ITG Officials: the [[https://www.google.com/url?q=https://mega.nz/file/mEoyiQRB%2523D7VUynt69-l3gKLO_Uily2KwrZ618O3fBJts63SfUkU&sa=D&source=editors&ust=1656530549484752&usg=AOvVaw1R291ssfKUZNJPoW6-JS6V][original ITG and ITG 2 packs]]
- ITG Stamina: [[https://docs.google.com/spreadsheets/d/1vnsJu85DxRA2Spq71g_MheY2B0_j99dPC1ap5RVQX-4/edit#gid=0][The Starter Pack of Stamina]]
- ITG Tech: [[https://itl2023.groovestats.com/][ITL Online 2023 (or whatever is most recent)]]

ITL Online starts at around ITG 7 block, but the rest have lowers which go down all the way to complete beginner level. Once you can clear ITG 11s, I highly recommend getting into [[https://srpg6.groovestats.com/][stamina RPG]] as well.

** Progressing Advice

Getting better at the game is what keeps it from sucking as a form of exercise, so I have some notes on what helped me with different blocks below. The important thing is that the more you play, the more efficient your form will become, which becomes super noticable over a long period of time.

#+BEGIN_EXPORT html
<iframe width="560" height="315" src="https://www.youtube.com/embed/gMlmlBGlB8Q" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
#+END_EXPORT

