org/articles/dancegames.org
** Breaking Through 10 block

Getting to 10 block (~15 new scale DDR) is mostly just about playing more, and learning to "walk". The two big things to know at this level are:

1. Put your foot on the arrow to step on the arrow, leave your foot on the panel after pressing the arrow, and lift that foot again only when you need that foot to press another arrow.
2. Try to alternate feet whenever possible. If you use the same foot twice in a row, you have to move your legs twice as fast.

If you try doing this, around 6-7 block you'll realize that there are some patterns where doing this is kind of hard. You'll have patterns where you have to put your right foot on the left arrow ("crossovers"), you'll have patterns where you have to step on the same arrow twice in a row ("jacks"), you'll have patterns where you have to step on two different arrows with the same foot ("double steps"), you'll have patterns where you have to travel the full distance from down to up, instead of just moving diagonally from down to right ("candles"). There are lots of different patterns and you shouldn't really stress out too much about it; just getting exposure to them will be enough at this level.

Different people spend different amount of time in this phase just depending on how generally coordinated, or experienced with rhythm games you are going into it. The important thing is to just enjoy yourself; there are hundreds of fun DDR charts specifically for players this level, and some very good beginner ITG packs which go far enough down in level to be playable by children. As long as the game is fun for you, it's all good if you remain at this level indefinitely: there will be more content than you can play even in hundreds of hours worth of sessions.

** Progression Advice for Stamina

Some advice which is semi-controversial, but has worked pretty well for me so far, is Beremy's [[https://itgwiki.dominick.cc/en/playstyles/stamina/thee-guide][thee guide]]. The basic idea here is: play 3x / week, take rest days, focus on playing bpm ranges where you cannot pass 64 measures of stream, make sure you eat enough protein. 

I get the impression /thee guide/ is kind of a meme, but the core idea matches what I've felt was the correct way to play with improvement in mind: stamina is about "passing the chart", so your sets should be charts which are hard to pass. You should spend a lot of your sets failing, and you should push that threshold higher as you pass harder and harder charts. It's somewhat difficult to manage mentally, and I do think it's good to play some longer stuff occasionally, but your sets should involve you pushing yourself if your aim is to improve.

 TODO: Write this section a bit more fleshed out. Recommend: considering sock material/footwear, sweat management, going for jogs, minimizing form, sliding.

** Progression Advice for Tech

Some notes I've seen suggested by good tech players:

- Play everything at every block level, play a lot.
- Play stuff you are bad at. If you struggle with something, play it until you can do it.
- When you are learning tech, focus more on /doing tech/ than getting good scores -- getting correct movements is more important than scoring marginally higher on a chart at your current level. (e.g. don't go back to jumps if brackets aren't working)
- Don't neglect playing stuff that feels "too easy", don't neglect playing stuff that feels "too hard".


** My Stamina Block Milestones

Below are my first-passes for stamina charts in a given block level. It's fun to keep track of these, but they're not that important. 

| Block | Date    | Chart                            |
|-------+---------+----------------------------------|
|   11? | 09/2021 | Dancin KRONO Extended Remix [11] |
|    12 | 11/2021 | [12][130] Spontaneous Me         |
|    13 | 12/2021 | [13][134] March of the ants      |
|    14 | 02/2022 | [14][160] Katamari on the Rocks  |

