articles/dancegames.html

<div id="outline-container-org35ef56e" class="outline-2">
<h2 id="org35ef56e">Breaking Through 10 block</h2>
<div class="outline-text-2" id="text-org35ef56e">
<p>
Getting to 10 block (~15 new scale DDR) is mostly just about playing more, and learning to "walk". The two big things to know at this level are:
</p>

<ol class="org-ol">
<li>Put your foot on the arrow to step on the arrow, leave your foot on the panel after pressing the arrow, and lift that foot again only when you need that foot to press another arrow.</li>
<li>Try to alternate feet whenever possible. If you use the same foot twice in a row, you have to move your legs twice as fast.</li>
</ol>

<p>
If you try doing this, around 6-7 block you'll realize that there are some patterns where doing this is kind of hard. You'll have patterns where you have to put your right foot on the left arrow ("crossovers"), you'll have patterns where you have to step on the same arrow twice in a row ("jacks"), you'll have patterns where you have to step on two different arrows with the same foot ("double steps"), you'll have patterns where you have to travel the full distance from down to up, instead of just moving diagonally from down to right ("candles"). There are lots of different patterns and you shouldn't really stress out too much about it; just getting exposure to them will be enough at this level.
</p>

<p>
Different people spend different amount of time in this phase just depending on how generally coordinated, or experienced with rhythm games you are going into it. The important thing is to just enjoy yourself; there are hundreds of fun DDR charts specifically for players this level, and some very good beginner ITG packs which go far enough down in level to be playable by children. As long as the game is fun for you, it's all good if you remain at this level indefinitely: there will be more content than you can play even in hundreds of hours worth of sessions.
</p>
</div>
</div>

<div id="outline-container-org0203b33" class="outline-2">
<h2 id="org0203b33">Progression Advice for Stamina</h2>
<div class="outline-text-2" id="text-org0203b33">
<p>
Some advice which is semi-controversial, but has worked pretty well for me so far, is Beremy's <a href="https://itgwiki.dominick.cc/en/playstyles/stamina/thee-guide">thee guide</a>. The basic idea here is: play 3x / week, take rest days, focus on playing bpm ranges where you cannot pass 64 measures of stream, make sure you eat enough protein. 
</p>

<p>
I get the impression <i>thee guide</i> is kind of a meme, but the core idea matches what I've felt was the correct way to play with improvement in mind: stamina is about "passing the chart", so your sets should be charts which are hard to pass. You should spend a lot of your sets failing, and you should push that threshold higher as you pass harder and harder charts. It's somewhat difficult to manage mentally, and I do think it's good to play some longer stuff occasionally, but your sets should involve you pushing yourself if your aim is to improve.
</p>

<p>
TODO: Write this section a bit more fleshed out. Recommend: considering sock material/footwear, sweat management, going for jogs, minimizing form, sliding.
</p>
</div>
</div>

<div id="outline-container-org4b327eb" class="outline-2">
<h2 id="org4b327eb">Progression Advice for Tech</h2>
<div class="outline-text-2" id="text-org4b327eb">
<p>
Some notes I've seen suggested by good tech players:
</p>

<ul class="org-ul">
<li>Play everything at every block level, play a lot.</li>
<li>Play stuff you are bad at. If you struggle with something, play it until you can do it.</li>
<li>When you are learning tech, focus more on <i>doing tech</i> than getting good scores &#x2013; getting correct movements is more important than scoring marginally higher on a chart at your current level. (e.g. don't go back to jumps if brackets aren't working)</li>
<li>Don't neglect playing stuff that feels "too easy", don't neglect playing stuff that feels "too hard".</li>
</ul>
</div>
</div>


<div id="outline-container-org43eeb04" class="outline-2">
<h2 id="org43eeb04">My Stamina Block Milestones</h2>
<div class="outline-text-2" id="text-org43eeb04">
<p>
Below are my first-passes for stamina charts in a given block level. It's fun to keep track of these, but they're not that important. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Block</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Chart</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">11?</td>
<td class="org-left">09/2021</td>
<td class="org-left">Dancin KRONO Extended Remix [11]</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">11/2021</td>
<td class="org-left">[12][130] Spontaneous Me</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">12/2021</td>
<td class="org-left">[13][134] March of the ants</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">02/2022</td>
<td class="org-left">[14][160] Katamari on the Rocks</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">06/2023</td>
<td class="org-left">[15][166] Maniac</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">07/2023</td>
<td class="org-left">[16][152] ITC Jams Vol. 4</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
